{"doc_id": "doc_1", "responses": [{"chunk_0": "<doc id=\"doc_1\"><section><content>The response of the said sensors is read-out in the form of the resistance across the active layer of each sensor; hence each measurement produced a 16-channel time series, each of which represented by an aggregate of features reflecting all the dynamic processes occurring at the sensor surface in reaction to the chemical substance being evaluated. In particular, two distinct types of features were considered in the creation of this dataset: (i) The so-called steady-state feature (ΔR), defined as the difference of the maximal resistance change and the baseline and its normalized version expressed by the ratio of the maximal resistance and the baseline values when the chemical vapor is present in the test chamber. And (ii), an aggregate of features reflecting the sensor dynamics of the increasing/decaying transient portion of the sensor response during the entire measurement procedure under controlled conditions, namely the exponential moving average (emaα). These aggregate of features is a transform, borrowed from the field of econometrics originally introduced to the chemo-sensing community by Muezzinoglu et al. (2009), that converts the said transient portion into a real scalar, by estimating the maximum value—minimum for the decaying portion of the sensor response—of its exponential moving average (emaα), with an initial condition set to zero and a scalar smoothing parameter of the operator, α, that defines both the quality of the feature and the time of its occurrence.</content></section></doc>\n"}, {"chunk_1": "<doc id=\"doc_1\"><title>Feature Extraction and Vector Organization</title><section><content>The features are extracted using an exponential moving average (EMAα), with an initial condition set to zero and a scalar smoothing parameter α (0<α<1). Three different α values were used for the rising and decaying portions of the sensor response.  For details, see Section 2.3 and Figure 2.  A 128-dimensional feature vector (8 features × 16 sensors) is formed: ΔR_1, |ΔR|_1, EMAi0.001_1, EMAi0.01_1, EMAi0.1_1, EMAd0.001_1, EMAd0.01_1, EMAd0.1_1, ΔR_2, |ΔR|_2, EMAi0.001_2, EMAi0.01_2, EMAi0.1_2, EMAd0.001_2, EMAd0.01_2, EMAd0.1_2,..., ΔR_16, |ΔR|_16, EMAi0.001_16, EMAi0.01_16, EMAi0.1_16, EMAd0.001_16, EMAd0.01_16, EMAd0.1_16, where ΔR_1 and |ΔR|_1 are the ΔR and normalized ΔR features respectively.</content></section></doc>\n"}, {"chunk_2": "<doc id=\"doc_1\"><content>R_16, |ΔR|_16, EMAi0.001_16, EMAi0.01_16, EMAi0.1_16, EMAd0.001_16, EMAd0.01_16, EMAd0.1_16, where: “ΔR_1” and “|ΔR|_1” is the ΔR and the normalized ΔR feature, respectively, “EMAi0.001_1”, “EMAi0.01_1”, and “EMAi0.1_1”, the emaα of the rising transient portion of the sensor response for α equals to 0.001, 0.01, and 0.1, respectively, and “EMAd0.001_1”, “EMAd0.01_1”, and “EMAd0.1_1”, the emaα of the decaying transient portion of the sensor response for α equals to 0.001, 0.01, and 0.1, respectively, all corresponding to sensor # 1; “ΔR_2” and “|ΔR|_2” is the ΔR and the normalized ΔR feature, respectively, “EMAi0.001_2”, “EMAi0.01_2”, and “EMAi0.1_2”, the emaα of the rising transient portion of the sensor response for α equals to 0.001, 0.01, and 0.1, respectively, and “EMAd0.001_2”, “EMAd0.01_2”, and “EMAd0.1_2”, the emaα of the decaying transient portion of the sensor response for α equals to 0.001, 0.01, and 0.1, respectively, all corresponding to sensor # 2; and so forth up until sensor # 16, forming thus the 128-dimensional feature vector that is to be fetched to the classifiers for training. For processing purposes, the data is organized into ten batches, each containing the number of measurements per class and month indicated in the table below. This reorganization of data was done to ensure having a sufficient and as uniformly distributed as possible number of experiments in each class and</content></doc>\n"}, {"chunk_3": "<doc id=\"doc_1\"><section><content>This reorganization of data was done to ensure having a sufficient and as uniformly distributed as possible number of experiments in each class and month indicated in the table below. Dataset organization details. Each row corresponds to months that were combined to form a batch: Batch ID Month IDs Batch 1 Months 1 and 2 Batch 2 Months 3, 4, 8, 9 and 10 Batch 3 Months 11, 12, and 13 Batch 4 Months 14 and 15 Batch 5 Month 16 Batch 6 Months 17, 18, 19, and 20 Batch 7 Month 21 Batch 8 Months 22 and 23 Batch 9 Months 24 and 30 Batch 10 Month 36 The data format follows the same coding style as in libsvm, in which one indicates the class each data point belongs to (1: Ethanol; 2: Ethylene; 3:Ammonia; 4: Acetaldehyde; 5: Acetone; 6: Toluene), and, then, the collection of features in a format x:v, where x stands for the feature number and v for the actual value of the feature. For example, in 1 1:15596.162100 2:1.868245 3:2.371604 4:2.803678 5:7.512213 ... 128:-2.654529 The number \"1\" stands for the class number (in this case Ethanol), whereas the remaining 128 columns list the actual feature values for each measurement recording organized as described above. Finally, to make the results presented in the associated article reproducible for the reader, please use the following parameter values in the training task: folds: 10 log2c = -5, 10, 1 log2g = -10, 5, 1 Scale the features in the training set appropriately</content></section></doc>\n"}, {"chunk_4": "<doc id=\"doc_1\"><section><content>For the reader, please use the following parameter values in the training task: folds: 10 log2c = -5, 10, 1 log2g = -10, 5, 1 Scale the features in the training set appropriately to lie between -1 and +1. And use the following cross validation parameters: Batch C Gamma Rate 1 256.0 0.03125 98.8764 2 64.0 0.00390625 99.7588 3 128.0 0.03125 100.0 4 1.0 0.25 100.0 5 2.0 0.015625 99.4924 6 256.0 0.0009765625 99.5217 7 64.0 0.0625 99.9723 8 1024.0 0.0078125 99.6599 9 2.0 0.00390625 100.0</content></section></doc>\n"}]}
{"doc_id": "doc_2", "responses": [{"chunk_0": "<doc id=\"doc_2\"><title>Introduction</title><section><content>Preserving and monitoring food quality is an increasingly important part of a healthy diet. In addition, the issue of climate change is becoming more and more prominent. As a result of climate change, the stability of global food systems, food security, and diet quality are decreasing. Climate change affects, among other things, changes in soil fertility and yield, the composition of food, the bioavailability of nutrients, and resistance to pests [1]. Many chemicals are used to determine the most basic qualitative characteristics of our food—dry matter, protein, fat, carbohydrates, fibre, etc. The protein content is usually determined by conducting the Kjeldahl destruction process, which is a destruction process with concentrated sulfuric acid at a high temperature (380 °C) [2]. The fat content is determined by using a large amount of organic solvents (petroleum ether, hexane, chloroform, etc.) [3]. The residues of these techniques have a harmful effect on the environment. Although effective, these traditional analytical techniques require energy and are time-consuming. To overcome these problems, a non-destructive and environmentally friendly chemical analytical method, near-infrared spectroscopy, offers the perfect solution. This is a secondary analytical technique which is based on mathematical relationships between the reference data and spectral results obtained by chemometric methods. The technical advances in NIR instruments and the proliferation</content></section></doc>\n"}, {"chunk_1": "<doc id=\"doc_2\"><title>NIR Spectroscopy in Food Quality Control</title><section><content>technique which is based on mathematical relationships between the reference data and spectral results obtained by chemometric methods. The technical advances in NIR instruments and the proliferation of chemometric computer software have made the technique one of the most used methods in the analytical toolbox. This is confirmed by the number of papers on the subject published over the past 20 years. Figure 1. Publications on the topic from 2005 to 2024 (based on Scopus). In this review work, the focus is exclusively on NIR spectroscopy techniques (NIRS). Other imaging techniques, such as hyperspectral or mid-infrared spectroscopy, are not discussed in this paper. The basic principles of NIRS and the explanation of different chemometric methods are only partially described in this manuscript, given the vast literature available on these two topics. For a more detailed overview, attention is drawn to some previous summary works [4, 5, 6]. A rapid analysis and, after knowing the results, a quick intervention—such as those which go into technical processes—are crucial during food quality control. Conventional analytical techniques are unable to accomplish this. A protracted sample preparation and a measurement phase are features of both traditional and instrumental techniques. Traditional methods necessitate the operation of quality control laboratories, which call for skilled workers. On the other hand, the NIR method can be applied offline, online, at-line, and in-line.</content></section></doc>\n"}, {"chunk_2": "<doc id=\"doc_2\"><section><content>Traditional methods necessitate the operation of quality control laboratories, which call for skilled workers. On the other hand, the NIR method can be applied offline, online, at-line, and in-line. In addition to not requiring the use of chemicals or sample preparation, it also operates without the need for skilled labour, which is crucial. When NIR sensors are positioned correctly in the technological process, we may quickly learn about the sample’s usual characteristics. The non-destructive technology uses a lot less energy than conventional analytical methods. The NIR method is not an absolute method, as its measurement accuracy depends on the accuracy of the reference method used. Nevertheless, it can be stated that this fast, non-destructive technique plays an increasing role in the quantitative determination of key parameters of foods. Chemometric methods, which are developing more and more, offer the possibility to identify the origin based on the spectra, to determine the maturity status, and to detect possible adulteration.</content></section><section><heading>Basics of NIR Spectroscopy</heading><content>The electromagnetic radiation range of 12,500–3800 cm −1 (800–2500 nm) is the near-infrared radiation (NIR) region. The energy in this range is no longer high enough to excite electron transitions, so only rotational and vibrational transitions can be detected. However, its energy is too high to detect these stretching and deformation vibrations (normal vibrations) clearly, so combinations and overtones of these</content></section></doc>\n"}, {"chunk_3": "<doc id=\"doc_2\"><section><content>nd vibrational transitions can be detected. However, its energy is too high to detect these stretching and deformation vibrations (normal vibrations) clearly, so combinations and overtones of these appear in the NIR spectrum. Figure 2. Excitation of vibration modes. Infra-active molecules and molecular groups can be studied in this range, which change their dipole moment in response to electromagnetic radiation. The recorded NIR spectrum consists of overtones and combination vibrations of molecules that contain CH, NH or OH groups. Figure 3. NIR band assignment [7]. Therefore, NIR spectroscopy is suitable for the analysis of organic substances in food, agriculture, feed, chemical, and pharmaceutical products. provides an overview of the NIR technique, including its optics, detection methods, spectrum recording options, light source, and sample type. Figure 4. An overview of the NIR technique. Focus should be placed on the spectra’s acquisition method. Figure 5. Measurement possibilities in NIR spectroscopy. Solid samples can be examined using the diffuse reflection method (PbS detector). Since the photon penetrates only a few millimetres deep into the sample in this instance, the layer thickness of the sample has no effect on the spectrum image. Although, in this instance, the particle dispersion needs to be carefully considered. A detrimental scattering phenomenon may result from an excessively diverse particle dispersion. The transmission technique can be applied</content></section></doc>\n"}, {"chunk_4": "<doc id=\"doc_2\"><section><content>Once, the particle dispersion needs to be carefully considered. A detrimental scattering phenomenon may result from an excessively diverse particle dispersion. The transmission technique can be applied to liquids (InGaS detector) or to colloidal samples (Si diode). The homogeneity of the samples is crucial when dealing with liquids. Otherwise, harmful scattering phenomena may occur. Depending on the sample, the ideal layer thickness (optical path length) can be between 0.5 and 2 mm. When examining colloidal samples, signal loss may occur due to inadequate layer thickness. If the layer thickness is too big, the infrared photon is absorbed and does not pass through the sample, while if the layer thickness is too small, the signal of the sample is detected, and, accordingly, we obtain a spectrum that is too noisy. In food analyses, colloidal samples with questionable homogeneity are common. To provide an “average″ image, the spectra are obtained in this instance while the samples are rotating. An insufficient spectrum is a common issue that arises when the transmission process is recorded. The transflection treatment can be conducted to get rid of this. It combines diffuse reflection and transmission. When measuring “problematic″ colloids, it is preferred. A special technique is the attenuated total reflectance (ATR) phenomenon, which is also known to be utilized in the NIR range but is typically used in the mid-infrared (MIR) range. It may be appropriate to obtain a summary of t</content></section></doc>\n"}, {"chunk_5": "<doc id=\"doc_2\"><section><content>Attenuated total reflectance (ATR) phenomenon, which is also known to be utilized in the NIR range but is typically used in the mid-infrared (MIR) range. It may be appropriate to obtain a summary of the most up-to-date infrared detection possibilities from Saleem et al.’s [8] summary study. Infrared detectors that are currently in use are based on traditional inorganic semiconductors like Si, Ge, and InGaAs. The need for cutting-edge imaging technologies is growing in other industrial applications, including virtual reality, driverless cars, and healthcare.</content></section></doc>\n"}]}
